docs/papers/20250901-democratizing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-23 Thu 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Democratizing interactivity: An overview of interfaces for multimedia machine learning</title>
<meta name="author" content="Alberto Arkader Kopiler, *Guilherme Schardong*, Luiz Schirmer, Daniel Perazzo, Tiago Novello, Luiz Velho," />
<meta name="generator" content="Org Mode" />
<meta name="referrer" content="origin" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Democratizing interactivity: An overview of interfaces for multimedia machine learning</h1>

<div id="outline-container-org80ebf53" class="outline-2">
<h2 id="org80ebf53">Abstract</h2>
<div class="outline-text-2" id="text-org80ebf53">
<p>
This paper provides an overview of interactive human–computer interfaces designed for multimedia processing pipelines that integrate machine learning, image processing, and computer graphics. It serves as a practical guide to existing techniques and tools for developing interactive applications in this domain. We outline key prerequisites, present relevant tools, and describe experiments that highlight the integration of these technologies. The study addresses usability challenges in interactive multimedia analysis and synthesis, taking advantage of recent advances in generative AI and multimodal data processing. Using real-time 2D and 3D interaction, we explore the design of dynamic interfaces that enable users to manipulate and visualize data within machine learning workflows, such as facial landmark detection and image morphing. Through case studies, we show accessible web-based frameworks that support the development of interactive, mobile-friendly applications that facilitate broader user engagement across platforms.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Alberto Arkader Kopiler, <b>Guilherme Schardong</b>, Luiz Schirmer, Daniel Perazzo, Tiago Novello, Luiz Velho,</p>
<p class="date">Created: 2025-10-23 Thu 13:47</p>
</div>
</body>
</html>
